week3/day18/artillery.config.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: 'Warm up'
    - duration: 120
      arrivalRate: 10
      name: 'Sustained load'
scenarios:
  - name: 'Health check'
    flow:
      - get:
          url: '/health'
      - get:
          url: '/api/v1/products'